app/controllers/individuals_controller.rb

  def index
    @individuals = current_user.individuals.all
---
SELECT "individuals".* FROM "individuals" WHERE "individuals"."user_id" = ?  [["user_id", 5]]

  def create
    @individual = current_user.individuals.new(individual_params)
    if @individual.save
---
INSERT INTO "individuals" ("first_name", "last_name", "gender", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Q"], ["last_name", "W"], ["gender", 1], ["user_id", 5], ["created_at", "2017-07-06 14:22:31.694913"], ["updated_at", "2017-07-06 14:22:31.694913"]]

  def update
    if @individual.update(individual_params)
---
UPDATE "individuals" SET "date_of_birth" = ?, "updated_at" = ? WHERE "individuals"."id" = ?  [["date_of_birth", "1882-04-25 00:00:00.000000"], ["updated_at", "2017-07-06 14:24:11.939093"], ["id", 1]]

  def destroy
    @individual.destroy
---
DELETE FROM "individuals" WHERE "individuals"."id" = ?  [["id", 5]]

  def set_individual
    @individual = current_user.individuals.find(params[:id])
---
SELECT  "individuals".* FROM "individuals" WHERE "individuals"."user_id" = ? AND "individuals"."id" = ? LIMIT 1  [["user_id", 5], ["id", 5]]