app/controllers/trees_controller.rb

  def index
    # @trees = Tree.where(:user_id => current_user.id)
    @trees = current_user.trees.all
---
SELECT "trees".* FROM "trees" WHERE "trees"."user_id" = ?  [["user_id", 3]]

  def create
    # @tree = current_user.trees.create!(tree_params)
    @tree = current_user.trees.new(tree_params)
    if @tree.save
---
INSERT INTO "trees" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "tree_1"], ["user_id", 2], ["created_at", "2017-07-05 10:37:10.618832"], ["updated_at", "2017-07-05 10:37:10.618832"]]

  def update
    # @tree = Tree.find(params[:id])
    if @tree.update(tree_params)
---
UPDATE "trees" SET "name" = ?, "updated_at" = ? WHERE "trees"."id" = ?  [["name", "tree_11"], ["updated_at", "2017-07-05 14:17:47.263655"], ["id", 1]]

  def destroy
    # @tree = Tree.find(params[:id])
    @tree.destroy
---
DELETE FROM "trees" WHERE "trees"."id" = ?  [["id", 6]]

  def set_tree
    @tree = current_user.trees.find(params[:id])
---
SELECT  "trees".* FROM "trees" WHERE "trees"."user_id" = ? AND "trees"."id" = ? LIMIT 1  [["user_id", 5], ["id", 9]]